Revit 2027 API
Document.GetTypeOfStorage Method
 Get the storage type of the identified built-in parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StorageType GetTypeOfStorage(
	ForgeTypeId parameterTypeId
)
Public Function GetTypeOfStorage (
	parameterTypeId As ForgeTypeId
) As StorageType
public:
StorageType GetTypeOfStorage(
	ForgeTypeId^ parameterTypeId
)
member GetTypeOfStorage :
        parameterTypeId : ForgeTypeId -> StorageType
Parameters
parameterTypeId ForgeTypeId
Identifier of the built-in parameter.
Return Value
StorageType
Storage type of the built-in parameter.
Exceptions
Exception | Condition
ArgumentException |  parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace